--------------------------------------------Создать датафрейм--------------------------------------------

In [218]:
import pandas as pd

df = [["Walonska 16", "Traugutta 76", "Shekspira 7", "Saksaganskogo 8"], [ "Viktoriia", "Olena", "Volodymyr", "Oleksii"], [ 28, 27, 32, 3]]
columns = ["address","name","age"]
df = pd.DataFrame(df, columns)
print(df)

                   0             1            2                3
address  Walonska 16  Traugutta 76  Shekspira 7  Saksaganskogo 8
name       Viktoriia         Olena    Volodymyr          Oleksii
age               28            27           32                3

In [13]:
import pandas as pd

df = [["Walonska 16", "Traugutta 76", "Shekspira 7", "Saksaganskogo 8"], [ 28, 27, 32, 3]]
columns = ["Viktoriia", "Olena", "Volodymyr", "Oleksii"]
df = pd.DataFrame(df, columns = columns)
print(df)

     Viktoriia         Olena    Volodymyr          Oleksii
0  Walonska 16  Traugutta 76  Shekspira 7  Saksaganskogo 8
1           28            27           32                3

In [220]:
df = [["Walloons 16", "Viktoriia", 28], ["Traugutta 76" , "Olena", 27], ["Shekspira 7", "Volodymyr", 32], [ "Saksaganskogo 8","Oleksii", 3]]
columns =  ["address","name","age"]
df = pd.DataFrame(df, columns = columns)
print(df)

           address       name  age
0      Walloons 16  Viktoriia   28
1     Traugutta 76      Olena   27
2      Shekspira 7  Volodymyr   32
3  Saksaganskogo 8    Oleksii    3

In [219]:
import pandas as pd
data = {'name':['Tom', 'Jack', 'Steve', 'Ricky'],'age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    name  age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

---------------------------------------------проверить тип-----------------------------------------

In [27]:
print(isinstance(df, pd.DataFrame))

True

=============invalid syntax: df[0], df[[0]], df[[:0]], df.loc[1, 1]================

-------------------------------------------Достать колонку по имени--------------------------------

In [42]:
df[['age']]

   age
0   28
1   27
2   32
3    3

In [144]:
df['age']

0    28
1    27
2    32
3     3
Name: age, dtype: int64

In [148]:
df[:]["age"]

0    28
1    27
2    32
3     3
Name: age, dtype: int64

In [71]:
df.loc[:,'age']

0    28
1    27
2    32
3     3
Name: age, dtype: int64

#колонка по индексу колонок

In [119]:
df.iloc[:, [1]]

   age
0   28
1   34
2   29
3   42

In [159]:
df.values[:,1]

array(['Viktoriia', 'Olena', 'Volodymyr', 'Oleksii'], dtype=object)

In [117]:
df.loc[:,df.columns[1]]

0    28
1    34
2    29
3    42
Name: age, dtype: int64

In [112]:
df.iloc[:, 1]

0    28
1    34
2    29
3    42
Name: age, dtype: int64

---------------------------#Достать определенную клетку-------------------------------------

In [152]:
df.at[0, df.columns[0]]

'Walloons 16'

In [163]:
df.at[2,"age"]

32

In [157]:
df.values[1,1]

'Olena'

In [156]:
df['age'][1]

27

In [143]:
df[df.columns[1]][1]

'Olena'

In [131]:
df.iloc[1, 1]

'Olena'

In [134]:
df.loc[1,'age']

27

In [135]:
df.loc[1,df.columns[1]]

'Olena'

In [136]:
df.iloc[1, [1]]

name    Olena
Name: 1, dtype: object

-----------------------------------достать строчку-------------------------------------

In [158]:
df.values[1,:]

array(['Traugutta 76', 'Olena', 27], dtype=object)

In [31]:
df.loc[0]

address    Walloons 16
name         Viktoriia
age                 28
Name: 0, dtype: object

In [30]:
df.loc[[0]]

       address       name  age
0  Walloons 16  Viktoriia   28

In [28]:
df.iloc[[0]]

       address       name  age
0  Walloons 16  Viktoriia   28

In [126]:
df.iloc[2]

address    Shekspira 7
name         Volodymyr
age                 32
Name: 2, dtype: object

In [128]:
df[:1]

       address       name  age
0  Walloons 16  Viktoriia   28

-------------------------------------------слайс-------------------------------------------------
ERRORS:#df.loc[1,1]

In [171]:
df[:2][:2]

        address       name  age
0   Walloons 16  Viktoriia   28
1  Traugutta 76      Olena   27

In [132]:
df.iloc[[1, 1]]

        address   name  age
1  Traugutta 76  Olena   27
1  Traugutta 76  Olena   27

In [164]:
df.loc[[1, 1]]

        address   name  age
1  Traugutta 76  Olena   27
1  Traugutta 76  Olena   27

In [160]:
df.values[:2,:3]

array([['Walloons 16', 'Viktoriia', 28],
       ['Traugutta 76', 'Olena', 27]], dtype=object)

In [173]:
df.iloc[1:4, 0:2]

           address       name
1     Traugutta 76      Olena
2      Shekspira 7  Volodymyr
3  Saksaganskogo 8    Oleksii

---------------------------------------несколько колонок-------------------------------------------

In [179]:
df[1:4][['age', 'name']]

   age       name
1   27      Olena
2   32  Volodymyr
3    3    Oleksii

In [177]:
df.iloc[1:4][['age', 'name']]

   age       name
1   27      Olena
2   32  Volodymyr
3    3    Oleksii

In [178]:
df.loc[1:4][['age', 'name']]

   age       name
1   27      Olena
2   32  Volodymyr
3    3    Oleksii

In [181]:
df.iloc[1:4, [1, 0]]

        name          address
1      Olena     Traugutta 76
2  Volodymyr      Shekspira 7
3    Oleksii  Saksaganskogo 8

In [186]:
df[df.columns[0:5]][1:4]

           address       name  age
1     Traugutta 76      Olena   27
2      Shekspira 7  Volodymyr   32
3  Saksaganskogo 8    Oleksii    3

In [188]:
df[df.columns[0:5]]

           address       name  age
0      Walloons 16  Viktoriia   28
1     Traugutta 76      Olena   27
2      Shekspira 7  Volodymyr   32
3  Saksaganskogo 8    Oleksii    3

----------------------------как достать значения ----------------------------------

In [189]:
df[df['age'] > 25]

        address       name  age
0   Walloons 16  Viktoriia   28
1  Traugutta 76      Olena   27
2   Shekspira 7  Volodymyr   32

In [190]:
df[(df['age'] > 25) & (df['name'] == 'Viktoriia')]

       address       name  age
0  Walloons 16  Viktoriia   28

In [191]:
df.query('age > 25')

        address       name  age
0   Walloons 16  Viktoriia   28
1  Traugutta 76      Olena   27
2   Shekspira 7  Volodymyr   32

In [193]:
df.loc[lambda x: x['age'] > 27]

       address       name  age
0  Walloons 16  Viktoriia   28
2  Shekspira 7  Volodymyr   32

In [195]:
df[df['name'].str.len() > 6]

           address       name  age
0      Walloons 16  Viktoriia   28
2      Shekspira 7  Volodymyr   32
3  Saksaganskogo 8    Oleksii    3

---------------------------------------заполнить колонки---------------------------------------------

In [199]:
df['name'] = 0
df

           address  name  age
0      Walloons 16     0   28
1     Traugutta 76     0   27
2      Shekspira 7     0   32
3  Saksaganskogo 8     0    3

-----------------------добавить колонку-----------------------------------

In [201]:
df['C'] = [10, 20, 30, 40]
df

           address  name  age   C
0      Walloons 16     0   28  10
1     Traugutta 76     0   27  20
2      Shekspira 7     0   32  30
3  Saksaganskogo 8     0    3  40

In [ ]:
# Создаем два DataFrame
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'],
                    'value': [5, 6, 7, 8]})

# Пример merge по ключу
merged_df = pd.merge(df1, df2, on='key', how='inner')
print("Merged DataFrame:")
print(merged_df)

In [ ]:
# Создаем два DataFrame
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['B', 'D', 'E', 'F'],
                    'value': [5, 6, 7, 8]})

concatenated_df = pd.concat([df1, df2], ignore_index=True)
print("\nConcatenated DataFrame:")
print(concatenated_df)

--------------------------заполнить конкретное значение---------------------------

In [203]:
df.loc[df['name'] == 0, 'name'] = 'Viktoriia'
df

           address       name  age   C
0      Walloons 16  Viktoriia   28  10
1     Traugutta 76  Viktoriia   27  20
2      Shekspira 7  Viktoriia   32  30
3  Saksaganskogo 8  Viktoriia    3  40

In [205]:
df.at[1, 'name'] = 'orange'
df

           address       name  age   C
0      Walloons 16  Viktoriia   28  10
1     Traugutta 76     orange   27  20
2      Shekspira 7  Viktoriia   32  30
3  Saksaganskogo 8  Viktoriia    3  40

----------------------------заполнить строчку----------------------------------

In [207]:
df.iloc[1] = "6"
df

           address       name age   C
0      Walloons 16  Viktoriia  28  10
1                6          6   6   6
2      Shekspira 7  Viktoriia  32  30
3  Saksaganskogo 8  Viktoriia   3  40

-----------------------------заполнить nan---------------------------

In [197]:
df['name'].fillna(0)

0    Viktoriia
1        Olena
2    Volodymyr
3      Oleksii
Name: name, dtype: object

---------------------------------------------удалить колонки------------------------------------------

In [223]:
print(df)
df = df.drop(df.columns[1], axis=1)
df

           address       name  age
0      Walloons 16  Viktoriia   28
1     Traugutta 76      Olena   27
2      Shekspira 7  Volodymyr   32
3  Saksaganskogo 8    Oleksii    3

           address  age
0      Walloons 16   28
1     Traugutta 76   27
2      Shekspira 7   32
3  Saksaganskogo 8    3

-----------------------------------------удалить конкретное значение--------------------------------------

In [226]:
df['age'] = df['age'].replace(32, pd.NA)
df

           address   age
0      Walloons 16    28
2      Shekspira 7  <NA>
3  Saksaganskogo 8     3

-----------------------------------------------удалить строчку--------------------------------------------------

In [224]:
print(df)
df = df.drop(1, axis=0)
df

           address  age
0      Walloons 16   28
1     Traugutta 76   27
2      Shekspira 7   32
3  Saksaganskogo 8    3

           address  age
0      Walloons 16   28
2      Shekspira 7   32
3  Saksaganskogo 8    3